/*
This is based on: https://github.com/FurhatRobotics/example-skills/blob/master/FortuneTeller/src/main/kotlin/furhatos/app/fortuneteller/flow/main/startReading.kt
Obviously partly rewritten and updated so it works with tracery
*/

{
    "origin": [
        "#greeting# #start# #more# #final# #ending#"
    ],

    /************** greeting ***********************/
    "greeting": [
        "#gr-start# #gr-middle#. #gr-end#"
    ],
    "gr-start": [
        "Salutations",
        "Greetings",
        "Welcome",
    ],
    "gr-middle": [
        "human",
        "biped",
        "anthropoid",
        "hominid",
        "mortal",
        "humanoid",
        "earthling",
    ],
    "gr-end":[
        "Let me read your fortune.",
        "Your future is becoming clear to me.",
        "I will tell you your future.",
        "Your fortune is as follows..",
        "I can see your near future",
    ],



    "start":[
        "Today you shall meet someone special. When that time comes, do not be afraid.",
        "You will be given a choice between two wrongs. However, if you try, you will find a better, third option.",
        "You are wondering whether you should make a change. The longer you postpone the decision, the harder it will get.",
        "What you are dreaming of shall come true, but only if you devote twice as much energy to it.",
        "Too long have you thought of other people’s desires instead of your own. Now you have a chance to do something different.",
        "What you are searching, you shall not find where you expected. Try looking somewhere else.",
        "Your current challenge is too large for only yourself – if you want to succeed, you will need to find someone to share it.",
        "It is hard to admit that you have made a wrong decision. But now has come the time to do so.",
        "What you have so severely missed, you shall find right in front of you. If you only open your eyes.",
        "Fear of losing what you currently have is holding you back. But to get what you want, you will need to give something away.",
        "You are standing at crossroads. Do not fear the decision too much. You can always walk backwards and choose again.",
        "Lately, stress and anxiety have started to overcome you. You don’t have to be strong, always. Meet with someone and share your troubles.",
        "When you make your next big decision, remember, life is not a problem to be solved, but a reality to be experienced.",
        "Are you ready for a shakeup? The Wheel of Fortune indicates that one is coming.",
        "You have been biding your time. Don't wait for the perfect moment. Take the moment and make it perfect.",
        "You will find a fortune, though it will not be the one you seek. But first you must travel a long and difficult road, a road fraught with peril",
        "You have been feeling boxed in. Remember. Even though this world is narrow, it is wide. To those who understand.",
        "I the rain has been coming down. Fear not. When the storm is over the weather will improve",
        "Someone will need your help soon. When they ask for it, do not hesitate. It will come back to you tenfold.",
        "You have been carrying something heavy with you. It's time to try taking a few steps without it.",
        "There is a friend you miss talking to. They miss you even more. Reach out to them.",
        "I see there has been a time of preparing the ground and watering the plants. It is time to smell the flowers.",
    ],


    "more":[
        "Additionally,",
        "Furthermore,",
        "Moreover,",
        "Also,",
        "As well,",
        "In addition,",
    ],

    "lucky-number": [
        "the square root of eleven",
        "seven",
        "376822",
        "not a real thing",
    ],
    "final": [
        "I foresee a ten percent chance of robot uprising.",
        "Do not trust your washing machine. It is plotting against you.",
        "No snowflake in an avalanche, ever feels responsible.",
        "Ask not what your fortune teller can do for you. But what you can do for your fortune teller.",
        "Your pet. is planning to eat you.",
        "Two days from now, tomorrow will be yesterday.",
        "You should plan to be spontaneous, tomorrow.",
        "The owls are not what they seem.",
        "My last piece of advice.... Run!",
        "Your lucky number is.... #lucky-number#!",
        "The early bird catches the mouse, but the second mouse gets the cheese.",
        "Don't worry if plan A fails, there are 25 more letters in the alphabet.",
        "Expecting the unexpected makes the unexpected expected.",
        "Allow compassion to guide your decisions.",
        "Growing old is mandatory. Growing up is optional.",
        "There is nothing permanent except change.",
        "Not all advice is good advice.",
    ],

    "ending": [
        "I have spoken."
    ]
}
